### 주어진 데이터에서 2022년 월별 Sales 합계 중 가장 큰 금액과 
### 2023년 월별 Sales 합계 중 가장 큰 금액의 차이를 절대값으로 구하시오. 
### 단 Events컬럼이 '1'인경우 80%의 Salse값만 반영함 
### (최종값은 소수점 반올림 후 정수 출력)
- 데이터셋 : basic2.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [1]:
# 라이브러리 불러오기
import pandas as pd

In [2]:
# 데이터 불러오기 (datatime컬럼 지정)
df = pd.read_csv("data/basic2.csv", parse_dates=['Date'])

In [3]:
df.head()

        Date     Sales      PV      UV  Events
0 2022-01-01  22711525  397349  4421.0       1
1 2022-01-02     36779    3969  2289.0       0
2 2022-01-03  13943875  373890     NaN       1
3 2022-01-04   8088593  142054  2157.0       0
4 2022-01-05   2395374  190684     NaN       0

In [6]:
# 날짜 컬럼 생성

df['year'] = df.Date.dt.year
df['month'] = df.Date.dt.month
df.head()

        Date     Sales      PV      UV  Events  year  month
0 2022-01-01  22711525  397349  4421.0       1  2022      1
1 2022-01-02     36779    3969  2289.0       0  2022      1
2 2022-01-03  13943875  373890     NaN       1  2022      1
3 2022-01-04   8088593  142054  2157.0       0  2022      1
4 2022-01-05   2395374  190684     NaN       0  2022      1

In [33]:
# 일단 event에 따른 salse 반영값 구하기. 

# for문 사용해도는 되는데 ,, 좀 코드가 길어지고 자원사용이 심하지! 
# 알려준 방법대로 lambda를 사용해보자!

# 함수 만들기. 

def event_cond(x) :
    if x['Events'] == 1 :                  # 나의 경우 데이터프레임을 axis=1을 입력하면 행 전체가 들어옴. 따라서 각 속성을 표기할 수 있다. 
        x['Sales2'] = x['Sales']*0.8
    else :
        x['Sales2'] = x['Sales']
    return x                               # 이랬을때 return을 하지 않으면 외부로 반환되는 x(데이터프레임 행)이 없음. 

# 함수 적용

df = df.apply(lambda x : event_cond(x) , axis = 1) # 여기서 출력하고 말면! 그냥 변수 입력이 안되는겨 그러니까 df로 선언해줘야함. 
df.head()

        Date     Sales      PV      UV  Events  year  month      Sales2
0 2022-01-01  22711525  397349  4421.0       1  2022      1  18169220.0
1 2022-01-02     36779    3969  2289.0       0  2022      1     36779.0
2 2022-01-03  13943875  373890     NaN       1  2022      1  11155100.0
3 2022-01-04   8088593  142054  2157.0       0  2022      1   8088593.0
4 2022-01-05   2395374  190684     NaN       0  2022      1   2395374.0

In [34]:
# 조건에 맞는 가장 큰 금액 계산 
# 단 Events컬럼이 '1'인경우 80%의 Salse값만 반영함

max_22 = df[df['year'] == 2022].groupby('month').Sales2.sum().max()
max_23 = df[df['year'] == 2023].groupby('month').Sales2.sum().max()

In [39]:
# 연별 월간 max값 차이 

print(int(round(abs(max_22 - max_23),0))) # 정수로 출력하라 했으니까 데이터 형도 int로 바꿔줌.

42473436

---

#### lambda 함수! 

해당 함수는 어떻게 보면 ,, 되게 간단한 함수식을 짜는거라 생각하면 된다.  

```
lambda x : def 
```

위에서 보면 lambda의 x는 인수이고 : 오른쪽은 def이다. 즉 간이 함수라 생각하면된다.  
보통 복잡한 함수를 입력해야하는 경우 외부에서 함수를 만들어 선언하고 인자를 받아서 출력하는 형식으로 사용하면 된다.  

복잡한 함수를 lambda를 사용하는 이유는 리스트 혹은 데이터프레임의 특정 열, 인자들을 각각 받아서 여러개의 출력값으로 뱉고 싶어서 사용한다.

In [28]:
df[['Events','Sales']].apply(lambda x : x.max(), axis = 1)

0      22711525
1         36779
2      13943875
3       8088593
4       2395374
         ...
725    33846609
726     3659566
727     1164008
728     3977696
729     3719764
Length: 730, dtype: int64